In [1]:
import pandas as pd
import numpy as np

In [2]:
two_dimensional_list = [['dongwook', 50, 86], ['sineui', 89, 31], ['ikjoong', 68, 91], ['yoonsoo', 88, 75]]

In [3]:
my_df = pd.DataFrame(two_dimensional_list, columns = ['name', 'english score', 'math score'], index = ['a', 'b', 'c', 'd'])
print(type(my_df))
my_df

<class 'pandas.core.frame.DataFrame'>

       name  english score  math score
a  dongwook             50          86
b    sineui             89          31
c   ikjoong             68          91
d   yoonsoo             88          75

my_df.columns

In [4]:
my_df.columns

Index(['name', 'english score', 'math score'], dtype='object')

In [5]:
my_df.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [6]:
my_df.dtypes

name             object
english score     int64
math score        int64
dtype: object

In [7]:
names = ['dongwook', 'sinuei', 'ikjoong', 'yoonsoo']
english_scores = [50, 89, 68, 88]
math_scores = [80, 30, 95, 73]

In [8]:
dict1 = {
    'name' : names,
    'english_scores' : english_scores,
    'math_scores' : math_scores
}

dict2 = {
    'name' : np.array(names),
    'english_scores' : np.array(english_scores),
    'math_scores' : np.array(math_scores)
}

dict3 = {
    'name' : pd.Series(names),
    'english_scores' : pd.Series(english_scores),
    'math_scores' : pd.Series(math_scores)
}

df1 = pd.DataFrame(dict1)
df2 = pd.DataFrame(dict2)
df3 = pd.DataFrame(dict3)

print(df1)

       name  english_scores  math_scores
0  dongwook              50           80
1    sinuei              89           30
2   ikjoong              68           95
3   yoonsoo              88           73

In [9]:
import pandas as pd

my_list = [
    {'name' : 'Talyor Swift', 'birthday' : 'Decmeber 13, 1989', 'occupation' : 'Singer-songwriter'},
    {'name' : 'Aron Sorkin', 'birthday' : 'June 9, 1961', 'occupation' : 'Screenwriter'},
    {'name' : 'Harry Poter', 'birthday' : 'July 31, 1980', 'occupation' : 'Wizard'},
    {'name' : 'Ji-Sung Park', 'birthday' : 'February 25, 1981', 'occupation' : 'Footballer'}
]

df = pd.DataFrame(my_list)
# 정답 출력
df

           name           birthday         occupation
0  Talyor Swift  Decmeber 13, 1989  Singer-songwriter
1   Aron Sorkin       June 9, 1961       Screenwriter
2   Harry Poter      July 31, 1980             Wizard
3  Ji-Sung Park  February 25, 1981         Footballer

In [10]:
names = ['Taylor Swift', 'Aron Sorkin', 'Harry Poter', 'Ji-Sung Park']
birthday = ['December 13, 1989', 'June 9, 1961', 'July 31, 1980', 'February 25, 1981']
occupation = ['Singer-songwriter', 'Screenwriter', 'Wizard', 'Footballer']

In [11]:
dict1 = {
    'names' : pd.Series(names),
    'birthday' : pd.Series(birthday),
    'occupation' : pd.Series(occupation)
}

df = pd.DataFrame(dict1)
df

          names           birthday         occupation
0  Taylor Swift  December 13, 1989  Singer-songwriter
1   Aron Sorkin       June 9, 1961       Screenwriter
2   Harry Poter      July 31, 1980             Wizard
3  Ji-Sung Park  February 25, 1981         Footballer

In [12]:
iphone_df = pd.read_csv('C:/Users/choyj/Desktop/Python/Data Science/Intro/iphone.csv')

In [13]:
iphone_df

      Unnamed: 0         출시일  디스플레이  메모리     출시 버전 Face ID
0       iPhone 7  2016-09-16    4.7  2GB  iOS 10.0      No
1  iPhone 7 Plus  2016-09-16    5.5  3GB  iOS 10.0      No
2       iPhone 8  2017-09-22    4.7  2GB  iOS 11.0      No
3  iPhone 8 Plus  2017-09-22    5.5  3GB  iOS 11.0      No
4       iPhone X  2017-11-03    5.8  3GB  iOS 11.1     Yes
5      iPhone XS  2018-09-21    5.8  4GB  iOS 12.0     Yes
6  iPhone XS Max  2018-09-21    6.5  4GB  iOS 12.0     Yes

In [14]:
type(iphone_df)

pandas.core.frame.DataFrame

In [15]:
iphone_df = pd.read_csv('C:/Users/choyj/Desktop/Python/Data Science/Intro/iphone.csv', index_col = 0)

In [16]:
iphone_df

                      출시일  디스플레이  메모리     출시 버전 Face ID
iPhone 7       2016-09-16    4.7  2GB  iOS 10.0      No
iPhone 7 Plus  2016-09-16    5.5  3GB  iOS 10.0      No
iPhone 8       2017-09-22    4.7  2GB  iOS 11.0      No
iPhone 8 Plus  2017-09-22    5.5  3GB  iOS 11.0      No
iPhone X       2017-11-03    5.8  3GB  iOS 11.1     Yes
iPhone XS      2018-09-21    5.8  4GB  iOS 12.0     Yes
iPhone XS Max  2018-09-21    6.5  4GB  iOS 12.0     Yes